doc: improve README
